# #resources
1. stack overflow
2. books(python For data analysis)
3. podcast
4. data skeptic podcast

In [1]:
# series- one dim. data frame 
import pandas as pd

In [2]:
students=['alice','jack','Molly']
pd.Series(students)

0    alice
1     jack
2    Molly
dtype: object

In [3]:
numbers=[1,2,3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [4]:
students=['alice','jack',None]
pd.Series(students)

0    alice
1     jack
2     None
dtype: object

In [5]:
students=[1,2,None]
pd.Series(students)

0    1.0
1    2.0
2    NaN
dtype: float64

In [7]:
import numpy as np
np.isnan(np.nan)# to check if any null value present or not

True

In [9]:
students_scores={
    'Alice':'Physics',
    'Jack':'Chemistry',
    'Molly':'English'
}
s=pd.Series(students_scores)
s

Alice      Physics
Jack     Chemistry
Molly      English
dtype: object

In [10]:
s.index#find all the index

Index(['Alice', 'Jack', 'Molly'], dtype='object')

In [11]:
students=[('Alice','Brown'),('Jack','White'),('Molly','Green')]
pd.Series(students)

0    (Alice, Brown)
1     (Jack, White)
2    (Molly, Green)
dtype: object

In [12]:
s=pd.Series(['Physics','chem','english'],index=['Alice','Jack','Molly'])
s

Alice    Physics
Jack        chem
Molly    english
dtype: object

In [16]:
students_scores={
    'Alice':'Physics',
    'Jack':'Chemistry',
    'Molly':'English'
}
s=pd.Series(students_scores,index=['Alice','pratik'])#access only specific indexes values
s

Alice     Physics
pratik        NaN
dtype: object

# querying series

In [44]:
students_classes={
    'Alice':'Physics',
    'Jack':'Chemistry',
    'Molly':'English',
    'sam':'history'
}
s=pd.Series(students_classes)
s

Alice      Physics
Jack     Chemistry
Molly      English
sam        history
dtype: object

In [47]:
#indexing operator
#working as a getter and setter method
print(s.iloc[3])#find value of index 3(recommanded)
print(s.loc['Molly'])# find value using key name(recommanded)
print(s[3])#automatically works as 'iloc'
print(s['Molly'])#automatically works as 'loc'
s.loc['Molly']='abc'#change value of 'MOLLY'
s.iloc[1]='bcd'#change value at index 1
print(s)

history
abc
history
abc
Alice    Physics
Jack         bcd
Molly        abc
sam      history
dtype: object

In [27]:
grades=pd.Series([92,52,95,84])
total=np.sum(grades)
print(total/len(grades))

80.75

In [30]:
numbers=pd.Series(np.random.randint(0,1000,100000)) 
# print(numbers)
print(numbers.head())

0     42
1    830
2    989
3     77
4    503
dtype: int32

magic function

In [32]:
#magic functions
%%timeit -n 100#find out time taken by operation
total=0
for number in numbers:
    total+=number
total/len(numbers)

25.6 ms ± 2.98 ms per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [33]:
#operation is the same as above but it takes little time
%%timeit -n 100
total=np.sum(numbers)
total/len(numbers)
#conclusion : numpy perform better than traditional method.

352 µs ± 80.5 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [36]:
print(numbers.head())
numbers+=2
print(numbers.head())

for label,value in numbers.iteritems():
    numbers.set_value(label,value+2)
print(numbers.head())

0     44
1    832
2    991
3     79
4    505
dtype: int32
0     46
1    834
2    993
3     81
4    507
dtype: int32

D:\anaconda\lib\site-packages\ipykernel_launcher.py:6: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead

0     48
1    836
2    995
3     83
4    509
dtype: int32

In [40]:
%%timeit -n 10
s=pd.Series(np.random.randint(0,1000,1000))
for label,value in s.iteritems():
    s.loc[label]=value+2

282 ms ± 34.6 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [41]:
%%timeit -n 10
s=pd.Series(np.random.randint(0,1000,1000))
s+=2

793 µs ± 321 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [48]:
#append two series data
series3=series1.append(series2)

NameError: name 'series1' is not defined

# DATAFRAME

In [62]:
r1={'name':'Physics','class':'Chemistry','score':85}
r2={'name':'Physics1','class':'Chemistry1','score':95}
r3={'name':'Physics2','class':'Chemistry2','score':75}

df=pd.DataFrame([r1,r2,r3],index=['scholl1','school2','school3'])
df

             name       class  score
scholl1   Physics   Chemistry     85
school2  Physics1  Chemistry1     95
school3  Physics2  Chemistry2     75

In [63]:
r1=pd.Series({'name':'Physics','class':'Chemistry','score':85})
r2=pd.Series({'name':'Physics1','class':'Chemistry1','score':95})
r3=pd.Series({'name':'Physics2','class':'Chemistry2','score':75})

df=pd.DataFrame([r1,r2,r3],index=['scholl1','school2','school3'])
df

             name       class  score
scholl1   Physics   Chemistry     85
school2  Physics1  Chemistry1     95
school3  Physics2  Chemistry2     75

In [64]:
#access the dataaframe values using loc and iloc
print(df.loc['scholl1'])#accesss whole row
print(df.T.loc['name'])#access whole column 
print(df.loc['school2']['name'])#access specific value
print(df.loc[:,['name','score']])#access only two columns
print(df.loc[['scholl1','school2'],:])#access only two rows

name       Physics
class    Chemistry
score           85
Name: scholl1, dtype: object
scholl1     Physics
school2    Physics1
school3    Physics2
Name: name, dtype: object
Physics1
             name  score
scholl1   Physics     85
school2  Physics1     95
school3  Physics2     75
             name       class  score
scholl1   Physics   Chemistry     85
school2  Physics1  Chemistry1     95

In [75]:
copy_df=df.copy()
copy_df.drop('name',inplace=True,axis=1)
#by default axis=0 ---> points to row deletion, if it is 1 then it will point to column deletion
# if inplace value is TRUE then change will be reflect to original dataframe other wise it won't change 

del copy_df['class']# delete column

In [76]:

df['classranking']=None# to add new column with none vaues
print(df)

             name       class  score classranking
scholl1   Physics   Chemistry     85         None
school2  Physics1  Chemistry1     95         None
school3  Physics2  Chemistry2     75         None

In [80]:
df=pd.read_csv('./data.csv')
print(df.head())

   gender race/ethnicity parental level of education         lunch  \
0  female        group B           bachelor's degree      standard
1  female        group C                some college      standard
2  female        group B             master's degree      standard
3    male        group A          associate's degree  free/reduced
4    male        group C                some college      standard

  test preparation course  math score  reading score  writing score
0                    none          72             72             74
1               completed          69             90             88
2                    none          90             95             93
3                    none          47             57             44
4                    none          76             78             75

In [81]:
df.columns #print all the column names

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [87]:
#rename the column names
new_df=df.rename(columns={'gender':'new_gender',
                         'race/ethnicity':'race/ethnicity',
                         'parental level of education':'parental level of education',
                         'lunch':'lunch','test preparation course':'test preparation course',
                         'math score':'math score',
                         'reading score':'reading score',
                        'writing score':'writing score' })


new_df=new_df.rename(columns={'math score':'new math score'})#rename only one column 
print(new_df.head())

#rremove extra white spaces in column names
new_df=new_df.rename(mapper=str.strip,axis="columns")
print(new_df.head())

  new_gender race/ethnicity parental level of education         lunch  \
0     female        group B           bachelor's degree      standard
1     female        group C                some college      standard
2     female        group B             master's degree      standard
3       male        group A          associate's degree  free/reduced
4       male        group C                some college      standard

  test preparation course  new math score  reading score  writing score
0                    none              72             72             74
1               completed              69             90             88
2                    none              90             95             93
3                    none              47             57             44
4                    none              76             78             75
  new_gender race/ethnicity parental level of education         lunch  \
0     female        group B           bachelor's degree      standard
1     female        group C                some college      standard
2     female        group B             master's degree      standard
3       male        group A          associate's degree  free/reduced
4       male        group C                some college      standard

  test preparation course  new math score  reading score  writing score
0                    none              72             72             74
1               completed              69             90             88
2                    none              90             95             93
3                    none              47             57             44
4                    none              76             78             75

In [89]:
#change list of columns name to upper case
cols=list(df.columns)
cols=[x.upper().strip() for x in cols]
df.columns=cols
print(df.head())

   GENDER RACE/ETHNICITY PARENTAL LEVEL OF EDUCATION         LUNCH  \
0  female        group B           bachelor's degree      standard
1  female        group C                some college      standard
2  female        group B             master's degree      standard
3    male        group A          associate's degree  free/reduced
4    male        group C                some college      standard

  TEST PREPARATION COURSE  MATH SCORE  READING SCORE  WRITING SCORE
0                    none          72             72             74
1               completed          69             90             88
2                    none          90             95             93
3                    none          47             57             44
4                    none          76             78             75

In [93]:
#boolean masking
math_mask=df['MATH SCORE']>50
print(math_mask)
print(df[math_mask])

0       True
1       True
2       True
3      False
4       True
       ...
995     True
996     True
997     True
998     True
999     True
Name: MATH SCORE, Length: 1000, dtype: bool
     GENDER RACE/ETHNICITY PARENTAL LEVEL OF EDUCATION         LUNCH  \
0    female        group B           bachelor's degree      standard
1    female        group C                some college      standard
2    female        group B             master's degree      standard
4      male        group C                some college      standard
5    female        group B          associate's degree      standard
..      ...            ...                         ...           ...
995  female        group E             master's degree      standard
996    male        group C                 high school  free/reduced
997  female        group C                 high school  free/reduced
998  female        group D                some college      standard
999  female        group D                some college  free/reduced

    TEST PREPARATION COURSE  MATH SCORE  READING SCORE  WRITING SCORE
0                      none          72             72             74
1                 completed          69             90             88
2                      none          90             95             93
4                      none          76             78             75
5                      none          71             83             78
..                      ...         ...            ...            ...
995               completed          88             99             95
996                    none          62             55             55
997               completed          59             71             65
998               completed          68             78             77
999                    none          77             86             86

[850 rows x 8 columns]

In [94]:
#the where() function on the original dataframe
df.where(math_mask).head()

,GENDER,RACE/ETHNICITY,PARENTAL LEVEL OF EDUCATION,LUNCH,TEST PREPARATION COURSE,MATH SCORE,READING SCORE,WRITING SCORE
0,female,group B,bachelor's degree,standard,none,72.0,72.0,74.0
1,female,group C,some college,standard,completed,69.0,90.0,88.0
2,female,group B,master's degree,standard,none,90.0,95.0,93.0
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,male,group C,some college,standard,none,76.0,78.0,75.0

In [95]:
#remove NAN values
df.where(math_mask).dropna().head()

,GENDER,RACE/ETHNICITY,PARENTAL LEVEL OF EDUCATION,LUNCH,TEST PREPARATION COURSE,MATH SCORE,READING SCORE,WRITING SCORE
0,female,group B,bachelor's degree,standard,none,72.0,72.0,74.0
1,female,group C,some college,standard,completed,69.0,90.0,88.0
2,female,group B,master's degree,standard,none,90.0,95.0,93.0
4,male,group C,some college,standard,none,76.0,78.0,75.0
5,female,group B,associate's degree,standard,none,71.0,83.0,78.0

In [100]:
#filtering the data frame 
(df[df['GENDER']=='male'].head())

,GENDER,RACE/ETHNICITY,PARENTAL LEVEL OF EDUCATION,LUNCH,TEST PREPARATION COURSE,MATH SCORE,READING SCORE,WRITING SCORE
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
10,male,group C,associate's degree,standard,none,58,54,52

In [105]:
# do not use 'and' and 'or' , use '&' and '|'
#for multiple condition
df[(df['GENDER']=='male') & (df['LUNCH']=='standard')].head()

,GENDER,RACE/ETHNICITY,PARENTAL LEVEL OF EDUCATION,LUNCH,TEST PREPARATION COURSE,MATH SCORE,READING SCORE,WRITING SCORE
4,male,group C,some college,standard,none,76,78,75
10,male,group C,associate's degree,standard,none,58,54,52
11,male,group D,associate's degree,standard,none,40,52,43
13,male,group A,some college,standard,completed,78,72,70
16,male,group C,high school,standard,none,88,89,86

In [106]:
#use inbuilt function
#gt(x)- grater than x & lt(x)- less than x
df[df['MATH SCORE'].gt(70) & df['READING SCORE'].lt(60)]

,GENDER,RACE/ETHNICITY,PARENTAL LEVEL OF EDUCATION,LUNCH,TEST PREPARATION COURSE,MATH SCORE,READING SCORE,WRITING SCORE
279,male,group B,bachelor's degree,free/reduced,none,73,56,57
464,male,group A,bachelor's degree,standard,completed,75,58,62
520,male,group D,some college,standard,none,71,49,52
955,male,group E,associate's degree,standard,none,72,57,62
964,male,group D,some college,standard,none,72,57,58